TheMrPhantom/ZeitmessanlageV2/timepanel-hub75/sdkconfig.defaults
# ESP32-S3 HUB75 time panel defaults.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_FREERTOS_HZ=1000
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

CONFIG_TIMEPANEL_PANEL_WIDTH=64
CONFIG_TIMEPANEL_PANEL_HEIGHT=32
CONFIG_TIMEPANEL_MATRIX_CHAIN_WIDTH=4
CONFIG_TIMEPANEL_MATRIX_CHAIN_HEIGHT=1
CONFIG_TIMEPANEL_PANEL_BRIGHTNESS=50
CONFIG_TIMEPANEL_HUB75_DOUBLE_BUFFER=y
CONFIG_TIMEPANEL_BUTTON_GPIO=0
CONFIG_TIMEPANEL_PARCOURS_SECONDS=30
CONFIG_TIMEPANEL_PARCOURS_INTRO_SECONDS=5
CONFIG_TIMEPANEL_IDLE_SPLASH_SECONDS=300
CONFIG_TIMEPANEL_WIFI_CHANNEL=1
CONFIG_TIMEPANEL_MAC_ID=0x0002
CONFIG_TIMEPANEL_SENSOR_ENABLED=y
CONFIG_TIMEPANEL_SENSOR_I2C_PORT=0
CONFIG_TIMEPANEL_SENSOR_I2C_SDA_GPIO=35
CONFIG_TIMEPANEL_SENSOR_I2C_SCL_GPIO=36
CONFIG_TIMEPANEL_SENSOR_I2C_FREQUENCY_HZ=400000
# CONFIG_TIMEPANEL_SENSOR_I2C_INTERNAL_PULLUPS is not set
CONFIG_TIMEPANEL_SENSOR_LOG_INTERVAL_SECONDS=10

CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_USE_CANVAS=y
CONFIG_LV_USE_LABEL=y
CONFIG_LV_FONT_MONTSERRAT_8=y
CONFIG_LV_FONT_MONTSERRAT_10=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
